# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

coords = [(3, 6), (2, 1)]
print(coords)
sum_t = lambda x, y: x - y
dist = lambda x, y: (x**2 + y**2) ** (0.5)

X = sum_t(coords[0][0], coords[1][0])
Y = sum_t(coords[0][1], coords[1][1])
r = dist(X, Y)
print("%.3f" % r)